# -*- eval: (add-hook 'after-save-hook 'org-babel-tangle nil t); org-latex-default-figure-position: H; -*-
#+TITLE: گزارش جلسه چهارم
* انواع متغیر از لحاظ حوزه
متغیرهای Php از لحاظ حوزه سه نوع کلی دارند:
- Local
- Global
- Super-global

بر خلاف آنچه در دیگر زبان‌های پایه-C متغیرهای محلی با متغیرهای جهانی جایگزین نمی‌شوند.


#+CAPTION: متغیر {{{php($a)}}} چاپ نمی‌شود.
#+begin_src php :exports both
<?php
$a = 1; /* global scope */
function test()
{
    echo $a; /* reference to local scope variable */
}
test(); /* outputs none */
#+end_src

#+RESULTS:

برای استفاده از متغیرهای جهانی باید یکبار با کلید {{{php(global $var)}}} یا با استفاده
از آرایهٔ {{{php($GLOBALS['var'])}}} آنها را فراخوانی کرد.

#+CAPTION: استفاده از متغیرهای جهانی با کلمه کلیدی {{{php(global)}}}
#+begin_src php :exports both
<?php
$a = 1;
$b = 2;
function test()
{
    global $a, $b;
    $b = $a + $b;
}
test();
echo $b;
#+end_src

#+RESULTS:
: 3

متغیرهای سوپرگلوبال متغیرهایی هستند که در هر حوزه‌ای و در هر فایلی موجود و مشترک هستند.
این به آن معناست که برای آنها نیازی نیست از کلیدواژهٔ {{{php(global)}}} استفاده کرد.

لیست متغیرهای سوپرگلوبال:
- {{{php($GLOBAL)}}}
- {{{php($_SERVER)}}}
- {{{php($_GET)}}}
- {{{php($_POST)}}}
- {{{php($_FILES)}}}
- {{{php($_COOKIE)}}}
- {{{php($_SESSION)}}}
- {{{php($_REQUEST)}}}
- {{{php($_ENV)}}}

** گت و ست تایپ
تابع {{{php(gettype ( mixed $var ) : string)}}} برای گرفتن نوع داده یک متغیر استفاده می‌شود.
رشته‌های بازگشتی این تابع به شرح زیر است:
 - {{{php("bool")}}}
 - {{{php("int")}}}
 - {{{php("double")}}}
 - {{{php("string")}}}
 - {{{php("array")}}}
 - {{{php("object")}}}
 - {{{php("resource")}}}
 - {{{php("resource (closed)")}}}
 - {{{php("NULL")}}}
 - {{{php("unknown type")}}}

#+CAPTION: استفاده از {{{php(gettype())}}} برای گرفتن چند نوع داده
#+begin_src php :exports both
<?php
$data = [1, 1., null, new stdClass(), 'foo'];
foreach ($data as $value) {
    echo gettype($value), " ";
}
#+end_src

#+RESULTS:
: integer double NULL object string
 
تابع {{{php(settype ( mixed &$var \, string $type ) : bool)}}} برای تغییر نوع داده‌ها به کار می‌رود.

رشته‌های مورد قبول این تابع از این قرار است:
- {{{php("bool")}}}, {{{php("boolean")}}}
- {{{php("int")}}}, {{{php("integer")}}}
- {{{php("float")}}}, {{{php("double")}}}
- {{{php("string")}}}
- {{{php("array")}}}
- {{{php("object")}}}
- {{{php("null")}}}

#+CAPTION: تغییر نوع داده با استفاده از {{{php(settype())}}}
#+begin_src php :results none
<?php
$foo = "5bar"; // string
$bar = true; // boolean

settype($foo, "integer"); // 5 (integer)
settype($bar, "string"); // "1" (string)
#+end_src

